Revit 2026 API

# DocumentNewFlexPipe(IListXYZ, FlexPipeType) Method

---
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FlexPipe NewFlexPipe(
	IList<XYZ> points,
	FlexPipeType pipeType
)
```
```vb
Public Function NewFlexPipe (
	points As IList(Of XYZ),
	pipeType As FlexPipeType
) As FlexPipe
```
```cpp
public:
FlexPipe^ NewFlexPipe(
	IList<XYZ^>^ points,
	FlexPipeType^ pipeType
)
```
```fsharp
member NewFlexPipe :
        points : IList<XYZ> *
        pipeType : FlexPipeType -> FlexPipe
```

#### Parameters

points IListXYZ

pipeType FlexPipeType

#### Return Value

FlexPipe

#### Reference

Document Class

NewFlexPipe Overload

Autodesk.Revit.Creation Namespace